# 175. Combine Two Tables

Table: Person
```pandas
+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| personId    | int     |
| lastName    | varchar |
| firstName   | varchar |
+-------------+---------+
```
personId is the primary key (column with unique values) for this table.
This table contains information about the ID of some persons and their first and last names.

Table: Address
```pandas
+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| addressId   | int     |
| personId    | int     |
| city        | varchar |
| state       | varchar |
+-------------+---------+
```
addressId is the primary key (column with unique values) for this table.
Each row of this table contains information about the city and state of one person with ID = PersonId.

In [2]:
from pyglm.glm import column

import pandas as pd

data = [[1, 'Wang', 'Allen'], [2, 'Alice', 'Bob']]
person = pd.DataFrame(data, columns=['personId', 'firstName', 'lastName']).astype({'personId':'Int64', 'firstName':'object', 'lastName':'object'})
data = [[1, 2, 'New York City', 'New York'], [2, 3, 'Leetcode', 'California']]
address = pd.DataFrame(data, columns=['addressId', 'personId', 'city', 'state']).astype({'addressId':'Int64', 'personId':'Int64', 'city':'object', 'state':'object'})


def combine_two_tables(person: pd.DataFrame, address: pd.DataFrame) -> pd.DataFrame:
    return person.merge(address, on="personId", how="left")[["firstName", "lastName", "city", "state"]]

# 181. Employees Earning More Than Their Managers
Easy
Topics
premium lock icon
Companies
SQL Schema
Pandas Schema
Table: Employee
```
+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| id          | int     |
| name        | varchar |
| salary      | int     |
| managerId   | int     |
+-------------+---------+
```
id is the primary key (column with unique values) for this table.
Each row of this table indicates the ID of an employee, their name, salary, and the ID of their manager.


Write a solution to find the employees who earn more than their managers.

Return the result table in any order.

The result format is in the following example.



Example 1:

Input:
Employee table:
```
+----+-------+--------+-----------+
| id | name  | salary | managerId |
+----+-------+--------+-----------+
| 1  | Joe   | 70000  | 3         |
| 2  | Henry | 80000  | 4         |
| 3  | Sam   | 60000  | Null      |
| 4  | Max   | 90000  | Null      |
+----+-------+--------+-----------+
```
Output:
```
+----------+
| Employee |
+----------+
| Joe      |
+----------+
```
Explanation: Joe is the only employee who earns more than his manager.

In [19]:
data = [[1, 'Joe', 70000, 3], [2, 'Henry', 80000, 4], [3, 'Sam', 60000, None], [4, 'Max', 90000, None]]
employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'managerId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'managerId':'Int64'})

employee

   id   name  salary  managerId
0   1    Joe   70000          3
1   2  Henry   80000          4
2   3    Sam   60000       <NA>
3   4    Max   90000       <NA>

In [21]:
import pandas as pd

# df = pd.merge(employee,employee, left_on = 'managerId', right_on = 'id', suffixes = ('','_manager'))
df = employee.merge(employee, left_on = "id", right_on = "managerId", suffixes = ["_manager", ""])
df
# df[df.salary_manager < df.salary][["name"]].rename(columns = {'name': "Employee"})

,id_manager,name_manager,salary_manager,managerId_manager,id,name,salary,managerId
0,3,Sam,60000,<NA>,1,Joe,70000,3
1,4,Max,90000,<NA>,2,Henry,80000,4

In [36]:
df = employee.merge(employee[["id", "salary"]], left_on = "managerId", right_on = "id", suffixes = ["", "_manager"])
df = df[df.salary > df.salary_manager]
pd.DataFrame({"Employee": df.name})

  Employee
0      Joe

# 182. Duplicate Emails
Easy
Topics
premium lock icon
Companies
SQL Schema
Pandas Schema
Table: Person
```
+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| id          | int     |
| email       | varchar |
+-------------+---------+
```
id is the primary key (column with unique values) for this table.
Each row of this table contains an email. The emails will not contain uppercase letters.


Write a solution to report all the duplicate emails. Note that it's guaranteed that the email field is not NULL.

Return the result table in any order.

The result format is in the following example.



Example 1:

Input:
Person table:
```
+----+---------+
| id | email   |
+----+---------+
| 1  | a@b.com |
| 2  | c@d.com |
| 3  | a@b.com |
+----+---------+
```
Output:
```
+---------+
| Email   |
+---------+
| a@b.com |
+---------+
```

In [97]:
data = [[1, 'a@b.com'], [2, 'c@d.com'], [3, 'a@b.com']]
person = pd.DataFrame(data, columns=['id', 'email']).astype({'id':'Int64', 'email':'object'})

person

   id    email
0   1  a@b.com
1   2  c@d.com
2   3  a@b.com

In [ ]:
def duplicate_emails(person: pd.DataFrame) -> pd.DataFrame:
    return person[person.email.duplicated()][["email"]].drop_duplicates()

# 183. Customers Who Never Order
Easy
Topics
premium lock icon
Companies
SQL Schema
Pandas Schema
Table: Customers
```
+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| id          | int     |
| name        | varchar |
+-------------+---------+
```
id is the primary key (column with unique values) for this table.
Each row of this table indicates the ID and name of a customer.


Table: Orders
```
+-------------+------+
| Column Name | Type |
+-------------+------+
| id          | int  |
| customerId  | int  |
+-------------+------+
```
id is the primary key (column with unique values) for this table.
customerId is a foreign key (reference columns) of the ID from the Customers table.
Each row of this table indicates the ID of an order and the ID of the customer who ordered it.


Write a solution to find all customers who never order anything.

Return the result table in any order.

The result format is in the following example.



Example 1:

Input:
Customers table:
```
+----+-------+
| id | name  |
+----+-------+
| 1  | Joe   |
| 2  | Henry |
| 3  | Sam   |
| 4  | Max   |
+----+-------+
```
Orders table:
```
+----+------------+
| id | customerId |
+----+------------+
| 1  | 3          |
| 2  | 1          |
+----+------------+
```
Output:
```
+-----------+
| Customers |
+-----------+
| Henry     |
| Max       |
+-----------+
```

In [105]:
data = [[1, 'Joe'], [2, 'Henry'], [3, 'Sam'], [4, 'Max']]
customers = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})
data = [[1, 3], [2, 1]]
orders = pd.DataFrame(data, columns=['id', 'customerId']).astype({'id':'Int64', 'customerId':'Int64'})

In [107]:
customers

   id   name
0   1    Joe
1   2  Henry
2   3    Sam
3   4    Max

In [108]:
orders

   id  customerId
0   1           3
1   2           1

In [129]:
df = customers.merge(orders, how="left", left_on = "id", right_on="customerId")
df[df["customerId"].isna()][["name"]].rename({"name": "Customers"})

    name
1  Henry
3    Max